<script lang="ts">
	import Section from '$lib/base-components/Section.svelte';
	import Container from '$lib/base-components/Container.svelte';
	import Fade_In_Out from '$lib/components/Fade_In_Out.svelte';
	import Popap from '$lib/components/Popap.svelte';
	

	const categories: string[] = [
		'Все',
		'Сімейне право',
		'Військове право',
		'Адміністративне право',
		'Адміністративні провадження',
		'Цивільне право',
		'Господарське право',
		'Міграційне право та юридична допомога за кордоном',
		'Кримінальне право'
	];

	const data: Record<string, string[]> = {
		Все: [
			'Розірвання шлюбу',
			'Стягнення аліментів',
			'Позбавлення батьківських прав',
			'Шлюбний договір та контракт',
			'Встановлення місця проживання дитини з одним з батьків',
			'Поділ спільного майна подружжя',
			'Оформлення відстрочки від мобілізації',
			'Звільнення з військової служби або переміщення',
			'Оскарження постанов військово-лікарської комісії',
			'Отримання компенсаційних виплат чинним військовим',
			'Оскарження дій або бездіяльності субʼєкта владних повноважень',
			'Консультації з подання та змін до декларацій (НАЗК)',
			'Оскарження постанов при вчинення корупційних правопорушень',
			'Захист у справах про адміністративне правопорушення',
			'Оскарження адміністративних протоколів та постанов (ДТП, керування транспортним засобом у стані алкогольного спʼяніння, тощо)',
			'Цивільні спори',
			'Стягнення заборгованості',
			'Захист прав споживачів',
			'Купівля-продаж нерухомості',
			'Допомога при ДТП',
			'Земельні та житлові спори',
			'Спори з фінансовими та банківськими установами',
			'Спадкування',
			'Вступ у спадщину',
			'Захист інтелектуальної власності',
			'Зняття арешту з майна',
			'Виконавче провадження',
			'Захист інвестицій',
			'Корпоративні спори',
			'Захист інвестицій',
			'Захист бізнесу від рейдерства',
			'Стягнення за договором поставки',
			'Ліквідація юридичної особи',
			'Захист честі, гідності та ділової репутації',
			'Банкрутство',
			'Захист інтелектуальної власності',
			'Захист криптовалютних інвестицій',
			'Перетин кордону',
			'Міграційні послуги',
			'Послуги з відкриття юридичної особи за кордоном',
			'Укладання шлюбу за кордоном',
			'Представництво інтересів у консульських установах',
			'Захист у кримінальному провадженні',
			'Захист під час досудового розслідування',
			'Захист інтересів під час тимчасового затримання особи, арешту майна та застосування інших заходів забезпечення',
			'Представництво під час проведення слідчих дій',
			'Надання консультацій на будь-якому етапі провадження'
		],
		'Сімейне право': [
			'Розірвання шлюбу',
			'Стягнення аліментів',
			'Позбавлення батьківських прав',
			'Шлюбний договір та контракт',
			'Встановлення місця проживання дитини з одним з батьків',
			'Поділ спільного майна подружжя'
		],
		'Військове право': [
			'Оформлення відстрочки від мобілізації',
			'Звільнення з військової служби або переміщення',
			'Оскарження постанов військово-лікарської комісії',
			'Отримання компенсаційних виплат чинним військовим'
		],
		'Адміністративне право': [
			'Оскарження дій або бездіяльності субʼєкта владних повноважень',
			'Консультації з подання та змін до декларацій (НАЗК)',
			'Оскарження постанов при вчинення корупційних правопорушень'
		],
		'Адміністративні провадження': [
			'Оскарження адміністративних протоколів та постанов (ДТП, керування транспортним засобом у стані алкогольного спʼяніння, тощо)',
			'Захист у справах про адміністративне правопорушення'
		],
		'Цивільне право': [
			'Цивільні спори',
			'Стягнення заборгованості',
			'Захист прав споживачів',
			'Купівля-продаж нерухомості',
			'Допомога при ДТП',
			'Земельні та житлові спори',
			'Спори з фінансовими та банківськими установами',
			'Спадкування',
			'Вступ у спадщину',
			'Захист інтелектуальної власності',
			'Зняття арешту з майна',
			'Виконавче провадження',
			'Захист інвестицій'
		],
		'Господарське право': [
			'Корпоративні спори',
			'Захист інвестицій',
			'Захист бізнесу від рейдерства',
			'Стягнення за договором поставки',
			'Ліквідація юридичної особи',
			'Захист честі, гідності та ділової репутації',
			'Банкрутство',
			'Захист інтелектуальної власності',
			'Захист криптовалютних інвестицій'
		],
		'Міграційне право та юридична допомога за кордоном': [
			'Перетин кордону',
			'Міграційні послуги',
			'Послуги з відкриття юридичної особи за кордоном',
			'Укладання шлюбу за кордоном',
			'Представництво інтересів у консульських установах'
		],
		'Кримінальне право': [
			'Захист у кримінальному провадженні',
			'Захист під час досудового розслідування',
			'Захист інтересів під час тимчасового затримання особи, арешту майна та застосування інших заходів забезпечення',
			'Представництво під час проведення слідчих дій',
			'Надання консультацій на будь-якому етапі провадження'
		]
	};

	let activeCategory: string = categories[0];
	let subCategory: string = '';

	function setActiveCategory(category: string) {
		activeCategory = category;
	}

	let popupVisible = false;

	function openPopup() {
		popupVisible = true;
	}

	function closePopup() {
		popupVisible = false;
	}

</script>

<Section id="our_services_desktop" classes="hidden xl:block">
	<Container>
		<div>
			<Fade_In_Out duration={1000} threshold={0.2}>
				<div class="mb-20 flex flex-wrap justify-center px-[100px]">
					{#each categories as category}
						<button
							class={`filter-button ${category === activeCategory ? 'active' : ''}`}
							on:click={() => setActiveCategory(category)}
						>
							{category}
						</button>
					{/each}
				</div>
			</Fade_In_Out>

			<ul class="filter-list flex flex-col gap-10">
				{#each subCategory ? data[subCategory] : data[activeCategory] as item}
					<li class="filter-list-item p-5">
						{item}
						<button id="consultation-button" type="button"  on:click={openPopup}
							class=" whitespace-nowrap rounded bg-location_color px-5 py-2.5 text-xl text-white"
							>Отримати консультацію</button
						>
					</li>
				{/each}
			</ul>
			{#if popupVisible}
				<Popap on:close={closePopup} />
			{/if}
		</div>
	</Container>
</Section>

<style lang="postcss">
	.subcategories {
		display: flex;
		flex-direction: column;
		gap: 0.5rem;
		margin-bottom: 1rem;
	}
	.filter-button {
		padding: 0.5rem 1rem;
		font-size: 20px;
		margin-bottom: 10px;
		border: 1px solid #e4e4e4;
		cursor: pointer;
		transition: background-color 0.3s ease;
	}
	.filter-button:hover {
		background-color: #cab18a;
	}
	.filter-button.active {
		background-color: #e4e4e4;
		color: #292424;
		pointer-events: none;
	}
	.filter-list-item {
		display: flex;
		align-items: center;
		justify-content: space-between;
		gap: 10px;
		box-shadow:
			28px 15px 13px rgba(138, 133, 133, 0.01),
			16px 8px 11px rgba(138, 133, 133, 0.05),
			7px 4px 8px rgba(138, 133, 133, 0.09),
			2px 1px 4px rgba(138, 133, 133, 0.1);
		border-radius: 20px;
	}
</style>
